; domain
(define (domain joust-circuit)
(:requirements :strips :typing)
(:types arena competitor rank - object
  keep pavilion - arena
  knight trophy - competitor)

(:predicates (carried ?g - trophy ?t - knight ?l - rank)
       (for-claim ?g - trophy ?m - pavilion ?l - rank)
       (kept ?g - trophy ?l - rank)
       (offered ?g - trophy ?m -  pavilion ?l - rank)
       (succeeds ?l1 ?l2 - rank)
       (posted-at ?t - knight ?p - arena)
       (linked-to ?p1 ?p2 - arena))

(:action ride
 :parameters (?t - knight ?from ?to - arena)
 :precondition (and (posted-at ?t ?from) (linked-to ?from ?to))
 :effect (and (not (posted-at ?t ?from)) (posted-at ?t ?to)))

; ### LOAD ###
; ?l1 is the level of ?g ready to be loaded at ?m before loading
; ?l2 is the level of ?g ready to be loaded at ?m after loading
; ?l3 is the level of ?g in ?t before loading
; ?l4 is the level of ?g in ?t after loading

(:action claim
 :parameters (?g - trophy ?t - knight ?m - pavilion ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?m) (carried ?g ?t ?l3)
        (for-claim ?g ?m ?l2) (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (carried ?g ?t ?l4) (not (carried ?g ?t ?l3))
        (for-claim ?g ?m ?l1) (not (for-claim ?g ?m ?l2))))


; ### UNLOAD ###
; ?l1 is the level of ?g in ?t before unloading
; ?l2 is the level of ?g in ?t after unloading
; ?l3 is the level of ?g in ?d before unloading
; ?l4 is the level of ?g in ?d after unloading

(:action stash
 :parameters (?g - trophy ?t - knight ?d - keep ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?d) (carried ?g ?t ?l2)
        (kept ?g ?l3) (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (carried ?g ?t ?l1) (not (carried ?g ?t ?l2))
        (kept ?g ?l4) (not (kept ?g ?l3))))


; ### BUY ###
; ?l1 is the level of ?g on sale at ?m before buying
; ?l2 is the level of ?g on sale at ?m after buying
; ?l3 is the level of ?g ready to be loaded at ?m before buying
; ?l4 is the level of ?g ready to be loaded at ?m after buying

(:action seize
 :parameters (?t - knight ?g - trophy ?m - pavilion ?l1 ?l2 ?l3 ?l4 - rank)
 :precondition (and (posted-at ?t ?m) (offered ?g ?m ?l2) (for-claim ?g ?m ?l3)
        (succeeds ?l2 ?l1) (succeeds ?l4 ?l3))
 :effect (and (offered ?g ?m ?l1) (not (offered ?g ?m ?l2))
        (for-claim ?g ?m ?l4) (not (for-claim ?g ?m ?l3))))
)

; problem
; Domain designed by Alfonso Gerevini and Alessandro Saetti
; This file has been automatically generated by the generator available from
; http://zeus.ing.unibs.it/ipc-5/generators/index.html

(define (problem TPP)
(:domain joust-circuit)
(:objects
  trophy1 trophy2 trophy3 trophy4 - trophy
  knight1 knight2 - knight
  pavilion1 pavilion2 - pavilion
  keep1 keep2 keep3 - keep
  rank0 rank1 rank2 - rank)

(:init
  (succeeds rank1 rank0)
  (succeeds rank2 rank1)
  (for-claim trophy1 pavilion1 rank0)
  (for-claim trophy1 pavilion2 rank0)
  (for-claim trophy2 pavilion1 rank0)
  (for-claim trophy2 pavilion2 rank0)
  (for-claim trophy3 pavilion1 rank0)
  (for-claim trophy3 pavilion2 rank0)
  (for-claim trophy4 pavilion1 rank0)
  (for-claim trophy4 pavilion2 rank0)
  (kept trophy1 rank0)
  (kept trophy2 rank0)
  (kept trophy3 rank0)
  (kept trophy4 rank0)
  (carried trophy1 knight1 rank0)
  (carried trophy1 knight2 rank0)
  (carried trophy2 knight1 rank0)
  (carried trophy2 knight2 rank0)
  (carried trophy3 knight1 rank0)
  (carried trophy3 knight2 rank0)
  (carried trophy4 knight1 rank0)
  (carried trophy4 knight2 rank0)
  (linked-to pavilion1 pavilion2)
  (linked-to pavilion2 pavilion1)
  (linked-to keep1 pavilion2)
  (linked-to pavilion2 keep1)
  (linked-to keep2 pavilion1)
  (linked-to pavilion1 keep2)
  (linked-to keep3 pavilion2)
  (linked-to pavilion2 keep3)
  (offered trophy1 pavilion1 rank2)
  (offered trophy2 pavilion1 rank0)
  (offered trophy3 pavilion1 rank1)
  (offered trophy4 pavilion1 rank2)
  (offered trophy1 pavilion2 rank0)
  (offered trophy2 pavilion2 rank2)
  (offered trophy3 pavilion2 rank1)
  (offered trophy4 pavilion2 rank0)
  (posted-at knight1 keep2)
  (posted-at knight2 keep3))

(:goal (and
  (kept trophy1 rank1)
  (kept trophy2 rank2)
  (kept trophy3 rank2)
  (kept trophy4 rank1)))

)

; plan
1. (ride knight2 keep3 pavilion2)
   deleted: (posted-at knight2 keep3)
   added: (posted-at knight2 pavilion2)
   goals met: 0 of 4
2. (seize knight2 trophy3 pavilion2 rank0 rank1 rank0 rank1)
   deleted: (offered trophy3 pavilion2 rank1) (for-claim trophy3 pavilion2 rank0)
   added: (offered trophy3 pavilion2 rank0) (for-claim trophy3 pavilion2 rank1)
   goals met: 0 of 4
3. (seize knight2 trophy2 pavilion2 rank1 rank2 rank0 rank1)
   deleted: (offered trophy2 pavilion2 rank2) (for-claim trophy2 pavilion2 rank0)
   added: (offered trophy2 pavilion2 rank1) (for-claim trophy2 pavilion2 rank1)
   goals met: 0 of 4
4. (ride knight1 keep2 pavilion1)
   deleted: (posted-at knight1 keep2)
   added: (posted-at knight1 pavilion1)
   goals met: 0 of 4
5. (seize knight1 trophy4 pavilion1 rank1 rank2 rank0 rank1)
   deleted: (offered trophy4 pavilion1 rank2) (for-claim trophy4 pavilion1 rank0)
   added: (offered trophy4 pavilion1 rank1) (for-claim trophy4 pavilion1 rank1)
   goals met: 0 of 4
6. (claim trophy4 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy4 knight1 rank0) (for-claim trophy4 pavilion1 rank1)
   added: (carried trophy4 knight1 rank1) (for-claim trophy4 pavilion1 rank0)
   goals met: 0 of 4
7. (seize knight1 trophy1 pavilion1 rank1 rank2 rank0 rank1)
   deleted: (offered trophy1 pavilion1 rank2) (for-claim trophy1 pavilion1 rank0)
   added: (offered trophy1 pavilion1 rank1) (for-claim trophy1 pavilion1 rank1)
   goals met: 0 of 4
8. (ride knight1 pavilion1 keep2)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep2)
   goals met: 0 of 4
9. (stash trophy4 knight1 keep2 rank0 rank1 rank0 rank1)
   deleted: (carried trophy4 knight1 rank1) (kept trophy4 rank0)
   added: (carried trophy4 knight1 rank0) (kept trophy4 rank1)
   goals met: 1 of 4
10. (ride knight1 keep2 pavilion1)
   deleted: (posted-at knight1 keep2)
   added: (posted-at knight1 pavilion1)
   goals met: 1 of 4
11. (claim trophy1 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy1 knight1 rank0) (for-claim trophy1 pavilion1 rank1)
   added: (carried trophy1 knight1 rank1) (for-claim trophy1 pavilion1 rank0)
   goals met: 1 of 4
12. (ride knight1 pavilion1 keep2)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep2)
   goals met: 1 of 4
13. (stash trophy1 knight1 keep2 rank0 rank1 rank0 rank1)
   deleted: (carried trophy1 knight1 rank1) (kept trophy1 rank0)
   added: (carried trophy1 knight1 rank0) (kept trophy1 rank1)
   goals met: 2 of 4
14. (claim trophy2 knight2 pavilion2 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight2 rank0) (for-claim trophy2 pavilion2 rank1)
   added: (carried trophy2 knight2 rank1) (for-claim trophy2 pavilion2 rank0)
   goals met: 2 of 4
15. (ride knight2 pavilion2 keep3)
   deleted: (posted-at knight2 pavilion2)
   added: (posted-at knight2 keep3)
   goals met: 2 of 4
16. (stash trophy2 knight2 keep3 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight2 rank1) (kept trophy2 rank0)
   added: (carried trophy2 knight2 rank0) (kept trophy2 rank1)
   goals met: 2 of 4
17. (ride knight2 keep3 pavilion2)
   deleted: (posted-at knight2 keep3)
   added: (posted-at knight2 pavilion2)
   goals met: 2 of 4
18. (seize knight2 trophy2 pavilion2 rank0 rank1 rank0 rank1)
   deleted: (offered trophy2 pavilion2 rank1) (for-claim trophy2 pavilion2 rank0)
   added: (offered trophy2 pavilion2 rank0) (for-claim trophy2 pavilion2 rank1)
   goals met: 2 of 4
19. (claim trophy2 knight2 pavilion2 rank0 rank1 rank0 rank1)
   deleted: (carried trophy2 knight2 rank0) (for-claim trophy2 pavilion2 rank1)
   added: (carried trophy2 knight2 rank1) (for-claim trophy2 pavilion2 rank0)
   goals met: 2 of 4
20. (ride knight2 pavilion2 keep3)
   deleted: (posted-at knight2 pavilion2)
   added: (posted-at knight2 keep3)
   goals met: 2 of 4
21. (stash trophy2 knight2 keep3 rank0 rank1 rank1 rank2)
   deleted: (carried trophy2 knight2 rank1) (kept trophy2 rank1)
   added: (carried trophy2 knight2 rank0) (kept trophy2 rank2)
   goals met: 3 of 4
22. (ride knight2 keep3 pavilion2)
   deleted: (posted-at knight2 keep3)
   added: (posted-at knight2 pavilion2)
   goals met: 3 of 4
23. (claim trophy3 knight2 pavilion2 rank0 rank1 rank0 rank1)
   deleted: (carried trophy3 knight2 rank0) (for-claim trophy3 pavilion2 rank1)
   added: (carried trophy3 knight2 rank1) (for-claim trophy3 pavilion2 rank0)
   goals met: 3 of 4
24. (ride knight2 pavilion2 keep3)
   deleted: (posted-at knight2 pavilion2)
   added: (posted-at knight2 keep3)
   goals met: 3 of 4
25. (stash trophy3 knight2 keep3 rank0 rank1 rank0 rank1)
   deleted: (carried trophy3 knight2 rank1) (kept trophy3 rank0)
   added: (carried trophy3 knight2 rank0) (kept trophy3 rank1)
   goals met: 3 of 4
26. (ride knight1 keep2 pavilion1)
   deleted: (posted-at knight1 keep2)
   added: (posted-at knight1 pavilion1)
   goals met: 3 of 4
27. (seize knight1 trophy3 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (offered trophy3 pavilion1 rank1) (for-claim trophy3 pavilion1 rank0)
   added: (offered trophy3 pavilion1 rank0) (for-claim trophy3 pavilion1 rank1)
   goals met: 3 of 4
28. (claim trophy3 knight1 pavilion1 rank0 rank1 rank0 rank1)
   deleted: (carried trophy3 knight1 rank0) (for-claim trophy3 pavilion1 rank1)
   added: (carried trophy3 knight1 rank1) (for-claim trophy3 pavilion1 rank0)
   goals met: 3 of 4
29. (ride knight1 pavilion1 keep2)
   deleted: (posted-at knight1 pavilion1)
   added: (posted-at knight1 keep2)
   goals met: 3 of 4
30. (stash trophy3 knight1 keep2 rank0 rank1 rank1 rank2)
   deleted: (carried trophy3 knight1 rank1) (kept trophy3 rank1)
   added: (carried trophy3 knight1 rank0) (kept trophy3 rank2)
   goals met: 4 of 4
